# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     06
   Description :
   Author :       jusk?
   date：          2019/12/5
-------------------------------------------------
   Change Activity:
                   2019/12/5:
-------------------------------------------------
"""

# 定义匿名或内联函数
## 你想为 sort() 操作创建一个很短的回调函数，但又不想用 def 去写一个单行函数，
##  而是希望通过某个快捷方式以内联方式来创建这个函数。

add = lambda x, y: x + y
rs = add(2,3)
print(rs)
# 5

rs = add('hello', 'world')
print(rs)
# helloworld

