# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     06 复数的数学运算
   Description :
   Author :       jusk?
   date：          2019/12/30
-------------------------------------------------
   Change Activity:
                   2019/12/30:
-------------------------------------------------
"""

# -- 你写的最新的网络认证方案代码遇到了一个难题，并且你唯一的解决办法就是使用复数空间。
# -- 再或者是你仅仅需要使用复数来执行一些计算操作



## -- 复数可以用使用函数 complex(real, imag) 或者是带有后缀j的浮点数来指定

a = complex(2, 4 )
b = 3 - 5j
print(a)
# (2+4j)

print(b)
# (2+4j)


## -- 对应的实部、虚部和共轭复数可以很容易的获取
print(a.real)
# 2.0

print(a.imag)
# 4.0

print(a.conjugate())
# (2-4j)