# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     11 命名切片
   Description :
   Author :       jusk?
   date：          2019/12/26
-------------------------------------------------
   Change Activity:
                   2019/12/26:
-------------------------------------------------
"""

# -- 如果你的程序包含了大量无法直视的硬编码切片，并且你想清理一下代码。


## -- 假定你要从一个记录（比如文件或其他类似格式）中的某些固定位置提取字段：

######    0123456789012345678901234567890123456789012345678901234567890'
record = '....................100 .......513.25 ..........'
cost = int(record[20:23]) * float(record[31:37])
print(cost)
# 51325.0

## -- 优化
SHARES = slice(20, 23)
PRICE = slice(31, 37)
cost = int(record[SHARES]) * float(record[PRICE])
print(cost)
# 51325.0


# ------------------------------------------------------------
items = [0, 1, 2, 3, 4, 5, 6]
a = slice(2,4)
it_res = items[2:4]
print(it_res)
# [2, 3]

print(items[a])
# [2, 3]


# -------------------------------------------------------------

a = slice(5, 50, 2)
res_start = a.start
print(res_start)
# 5

res_stop = a.stop
print(res_stop)
# 50

res_step = a.step
print(res_step)
# 2


